#### Terraform Format and Style 🖌success
#### Terraform Initialization ⚙️success
#### Terraform Validation 🤖success
<details><summary>Validation Output</summary>

```

Success! The configuration is valid. 
```

</details>
#### Terraform Plan 📖success
<details><summary>Show Plan</summary>

```terraform

Acquiring state lock. This may take a few moments... data.terraform_remote_state.common: Reading... data.google_service_account_access_token.default: Reading... data.google_service_account_access_token.default: Read complete after 1s [id=projects/-/serviceAccounts/terraform@youtube-data-api-385206.iam.gserviceaccount.com] data.terraform_remote_state.common: Read complete after 3s Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols: + create Terraform will perform the following actions: # module.enable_google_apis.google_project_service.project_services["artifactregistry.googleapis.com"] will be created + resource "google_project_service" "project_services" { + disable_dependent_services = false + disable_on_destroy = false + id = (known after apply) + project = "youtube-data-api-385206" + service = "artifactregistry.googleapis.com" } # module.enable_google_apis.google_project_service.project_services["bigquery.googleapis.com"] will be created + resource "google_project_service" "project_services" { + disable_dependent_services = false + disable_on_destroy = false + id = (known after apply) + project = "youtube-data-api-385206" + service = "bigquery.googleapis.com" } # module.enable_google_apis.google_project_service.project_services["cloudresourcemanager.googleapis.com"] will be created + resource "google_project_service" "project_services" { + disable_dependent_services = false + disable_on_destroy = false + id = (known after apply) + project = "youtube-data-api-385206" + service = "cloudresourcemanager.googleapis.com" } # module.enable_google_apis.google_project_service.project_services["cloudscheduler.googleapis.com"] will be created + resource "google_project_service" "project_services" { + disable_dependent_services = false + disable_on_destroy = false + id = (known after apply) + project = "youtube-data-api-385206" + service = "cloudscheduler.googleapis.com" } # module.enable_google_apis.google_project_service.project_services["iam.googleapis.com"] will be created + resource "google_project_service" "project_services" { + disable_dependent_services = false + disable_on_destroy = false + id = (known after apply) + project = "youtube-data-api-385206" + service = "iam.googleapis.com" } # module.enable_google_apis.google_project_service.project_services["iamcredentials.googleapis.com"] will be created + resource "google_project_service" "project_services" { + disable_dependent_services = false + disable_on_destroy = false + id = (known after apply) + project = "youtube-data-api-385206" + service = "iamcredentials.googleapis.com" } # module.enable_google_apis.google_project_service.project_services["pubsub.googleapis.com"] will be created + resource "google_project_service" "project_services" { + disable_dependent_services = false + disable_on_destroy = false + id = (known after apply) + project = "youtube-data-api-385206" + service = "pubsub.googleapis.com" } # module.enable_google_apis.google_project_service.project_services["run.googleapis.com"] will be created + resource "google_project_service" "project_services" { + disable_dependent_services = false + disable_on_destroy = false + id = (known after apply) + project = "youtube-data-api-385206" + service = "run.googleapis.com" } # module.enable_google_apis.google_project_service.project_services["secretmanager.googleapis.com"] will be created + resource "google_project_service" "project_services" { + disable_dependent_services = false + disable_on_destroy = false + id = (known after apply) + project = "youtube-data-api-385206" + service = "secretmanager.googleapis.com" } # module.enable_google_apis.google_project_service.project_services["storage.googleapis.com"] will be created + resource "google_project_service" "project_services" { + disable_dependent_services = false + disable_on_destroy = false + id = (known after apply) + project = "youtube-data-api-385206" + service = "storage.googleapis.com" } # module.enable_google_apis.google_project_service.project_services["sts.googleapis.com"] will be created + resource "google_project_service" "project_services" { + disable_dependent_services = false + disable_on_destroy = false + id = (known after apply) + project = "youtube-data-api-385206" + service = "sts.googleapis.com" } # module.enable_google_apis.google_project_service.project_services["youtube.googleapis.com"] will be created + resource "google_project_service" "project_services" { + disable_dependent_services = false + disable_on_destroy = false + id = (known after apply) + project = "youtube-data-api-385206" + service = "youtube.googleapis.com" } # module.pubsub_subscription.google_pubsub_subscription.main will be created + resource "google_pubsub_subscription" "main" { + ack_deadline_seconds = 599 + effective_labels = (known after apply) + enable_message_ordering = false + id = (known after apply) + message_retention_duration = "1200s" + name = "stg-youtube-data-api-sub" + project = "youtube-data-api-385206" + terraform_labels = (known after apply) + topic = (known after apply) + dead_letter_policy { + dead_letter_topic = (known after apply) + max_delivery_attempts = 5 } + expiration_policy { # (1 unchanged attribute hidden) } + push_config { + push_endpoint = (known after apply) + oidc_token { + service_account_email = "cloudrun-invoker@youtube-data-api-385206.iam.gserviceaccount.com" } } + retry_policy { + maximum_backoff = (known after apply) + minimum_backoff = "10s" } } # module.pubsub_subscription.google_pubsub_subscription_iam_member.subscription_subscriber_role will be created + resource "google_pubsub_subscription_iam_member" "subscription_subscriber_role" { + etag = (known after apply) + id = (known after apply) + member = "serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com" + project = (known after apply) + role = "roles/pubsub.subscriber" + subscription = "stg-youtube-data-api-sub" } # module.pubsub_topic.google_pubsub_topic.main will be created + resource "google_pubsub_topic" "main" { + effective_labels = (known after apply) + id = (known after apply) + name = "stg-youtube-data-api" + project = "youtube-data-api-385206" + terraform_labels = (known after apply) } # module.pubsub_topic.google_pubsub_topic.main_dead_letter will be created + resource "google_pubsub_topic" "main_dead_letter" { + effective_labels = (known after apply) + id = (known after apply) + name = "stg-stg-youtube-data-api-dlq" + project = "youtube-data-api-385206" + terraform_labels = (known after apply) } # module.pubsub_topic.google_pubsub_topic_iam_member.topic_publisher_role will be created + resource "google_pubsub_topic_iam_member" "topic_publisher_role" { + etag = (known after apply) + id = (known after apply) + member = "serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com" + project = (known after apply) + role = "roles/pubsub.publisher" + topic = "stg-youtube-data-api" } # module.run.google_cloud_run_service_iam_member.api_invoker will be created + resource "google_cloud_run_service_iam_member" "api_invoker" { + etag = (known after apply) + id = (known after apply) + location = "asia-northeast1" + member = "serviceAccount:cloudrun-invoker@youtube-data-api-385206.iam.gserviceaccount.com" + project = "youtube-data-api-385206" + role = "roles/run.invoker" + service = "stg-youtube-data-api-api" } # module.run.google_cloud_run_v2_service.api will be created + resource "google_cloud_run_v2_service" "api" { + conditions = (known after apply) + create_time = (known after apply) + creator = (known after apply) + delete_time = (known after apply) + effective_annotations = (known after apply) + effective_labels = (known after apply) + etag = (known after apply) + expire_time = (known after apply) + generation = (known after apply) + id = (known after apply) + ingress = "INGRESS_TRAFFIC_INTERNAL_ONLY" + last_modifier = (known after apply) + latest_created_revision = (known after apply) + latest_ready_revision = (known after apply) + launch_stage = (known after apply) + location = "asia-northeast1" + name = "stg-youtube-data-api-api" + observed_generation = (known after apply) + project = "youtube-data-api-385206" + reconciling = (known after apply) + terminal_condition = (known after apply) + terraform_labels = (known after apply) + traffic_statuses = (known after apply) + uid = (known after apply) + update_time = (known after apply) + uri = (known after apply) + template { + max_instance_request_concurrency = (known after apply) + service_account = "youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com" + timeout = (known after apply) + containers { + image = "asia-northeast1-docker.pkg.dev/youtube-data-api-385206/stg-youtube-data-api-repository/stg-api-image:" + env { + name = "GOOGLE_PROJECT_ID" + value = "youtube-data-api-385206" } + env { + name = "PUBSUB_GENERATE_ANNOTATIONS_TOPIC" + value = "stg-youtube-data-api" } + env { + name = "CLOUD_STORAGE_BUCKET" + value = "stg-youtube-data-api-385206-bucket" } + env { + name = "YOUTUBE_API_SERVICE_NAME" + value = "youtube" } + env { + name = "YOUTUBE_API_VERSION" + value = "v3" } + env { + name = "SECRET_ID" + value = "YOUTUBE_API_KEY" } + env { + name = "SECRET_YOUTUBE_API_VERSION" + value = "1" } + resources { + cpu_idle = true + limits = { + "cpu" = "1000m" + "memory" = "1Gi" } } } + scaling { + max_instance_count = 3 + min_instance_count = 0 } } + traffic { + percent = 100 + type = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST" } } # module.scheduler.google_cloud_scheduler_job.invoke-transfer will be created + resource "google_cloud_scheduler_job" "invoke-transfer" { + description = "suggesting your lunch" + id = (known after apply) + name = "stg-invoke-transfer" + paused = (known after apply) + project = "youtube-data-api-385206" + region = "asia-northeast1" + schedule = "0 12 get_latest_tag.sh set_env.sh terraform_plan_comment.sh get_latest_tag.sh set_env.sh terraform_plan_comment.sh *" + state = (known after apply) + time_zone = "Asia/Tokyo" + http_target { + http_method = "POST" + uri = (known after apply) + oidc_token { + audience = (known after apply) + service_account_email = "cloudrun-invoker@youtube-data-api-385206.iam.gserviceaccount.com" } } + retry_config { + max_backoff_duration = (known after apply) + max_doublings = (known after apply) + max_retry_duration = (known after apply) + min_backoff_duration = (known after apply) + retry_count = 1 } } # module.storage.google_storage_bucket.bucket will be created + resource "google_storage_bucket" "bucket" { + effective_labels = (known after apply) + force_destroy = false + id = (known after apply) + location = "ASIA-NORTHEAST1" + name = "stg-youtube-data-api-385206-bucket" + project = (known after apply) + project_number = (known after apply) + public_access_prevention = (known after apply) + rpo = (known after apply) + self_link = (known after apply) + storage_class = "STANDARD" + terraform_labels = (known after apply) + uniform_bucket_level_access = (known after apply) + url = (known after apply) } # module.storage.google_storage_bucket_iam_member.member will be created + resource "google_storage_bucket_iam_member" "member" { + bucket = "stg-youtube-data-api-385206-bucket" + etag = (known after apply) + id = (known after apply) + member = "serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com" + role = "roles/storage.admin" } Plan: 22 to add, 0 to change, 0 to destroy. ───────────────────────────────────────────────────────────────────────────── Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now. 
```

</details>
*Pusher: @Kamegrueon, Action: pull_request, Working Directory: , Workflow: cicd*
